src/cf/InformationRegisters/НастройкиУчетаЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиУчетаЗарплаты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИспользоватьФорматОбменаЗУП25</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СписаниеДепонированныхСумм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВБухУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезервОтпусков</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Резервы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПродолжительностьОтпуска</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаАванса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаАванса</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аванс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИндивидуальныйАванс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерЕжегоднойПремии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьРасчетПервойПоловиныМесяца</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьДатаВыплатыАванса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьДатаВыплатыЗарплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/КатегорииНачисленийИНеоплаченногоВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>КатегорииНачисленийИНеоплаченногоВремени</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПовременнаяОплатаТруда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РайонныйКоэффициент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СевернаяНадбавка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаОтпуска</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускПоБеременностиИРодам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаБольничногоЛиста</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаБольничногоЛистаЗаСчетРаботодателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаБольничногоПрофзаболевание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаБольничногоНесчастныйСлучайНаПроизводстве</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаКомандировки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БолезньБезОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускБезОплаты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/РезервыПоОплатеТрудаДляНебольшихОрганизацийПереопределяемый/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Учет резервов для небольших организаций.
// Переопределяемое в потребителе поведение.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Процедура предназначена для заполнения в полученной таблице информации об особенностях расчета отпусков
// с учетом специфики места внедрения.
//
// Параметры:
//   НачисленнаяЗарплатаИВзносы - таблица значений
//		Структура таблицы НачисленнаяЗарплатаИВзносы (необходимые колонки)
//			Начисление
//			КомпенсацияОтпуска
//
Процедура ДополнитьТаблицуСведениямиОбОсобенностяхОтпусков(НачисленнаяЗарплатаИВзносы) Экспорт
	
	Отбор = Новый Структура("КатегорияНачисленияИлиНеоплаченногоВремени", Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаОтпуска);
	ВидНачисленияОтпуск = ПланыВидовРасчета.Начисления.НачислениеПоУмолчанию(Отбор);
	
	ВидыНачисления = ПланыВидовРасчета.Начисления.НачисленияПоОтбору(Новый СТруктура("Код", "КОТ"));
	Если ВидыНачисления.Количество() <> 0 Тогда
		ВидНачисленияКомпенсацияОтпуска = ВидыНачисления[0];
	Иначе
		ВидНачисленияКомпенсацияОтпуска = "";
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из НачисленнаяЗарплатаИВзносы Цикл
		
		Если СтрокаТаблицы.Начисление = ВидНачисленияОтпуск
			Или СтрокаТаблицы.Начисление = ВидНачисленияКомпенсацияОтпуска Тогда
			СтрокаТаблицы.ВидОтпуска = "Основной";
		КонецЕсли;
		СтрокаТаблицы.КомпенсацияОтпуска = СтрокаТаблицы.Начисление = ВидНачисленияКомпенсацияОтпуска;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура предназначена для проверки наличия обмена с программой учета зарплаты
//
// Параметры:
//   ОбменИспользуется - Булево, переопределяется в зависимости от настройки
//
Процедура ОбменИспользуется(ОбменИспользуется) Экспорт
	
	Если ОбменИспользуется Тогда
		Возврат;
	КонецЕсли;
		
	Если Не ОбменИспользуется Тогда
		
		МДПланОбмена = Метаданные.ПланыОбмена.Найти("СинхронизацияДанныхЧерезУниверсальныйФормат");
		Если МДПланОбмена <> Неопределено Тогда
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ЭтотУзел",               ПланыОбмена["СинхронизацияДанныхЧерезУниверсальныйФормат"].ЭтотУзел());
			Запрос.УстановитьПараметр("ИдентификаторНастройки", "ОбменЗУПБП");
			Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ОбменЗарплата3Бухгалтерия3.Ссылка
			|ИЗ
			|	#ПолноеИмяПланаОбмена КАК ОбменЗарплата3Бухгалтерия3
			|ГДЕ
			|	ОбменЗарплата3Бухгалтерия3.Ссылка <> &ЭтотУзел
			|	И ОбменЗарплата3Бухгалтерия3.ВариантНастройки = &ИдентификаторНастройки";
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ПолноеИмяПланаОбмена", МДПланОбмена.ПолноеИмя());
			ОбменИспользуется = Не Запрос.Выполнить().Пустой();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура предназначена для дополнения таблицы параметров данными о проценте годовой премии
// и с учетом специфики места внедрения.
//
// Параметры:
//   Организация       - Спр.Организации.СправочникСсылка - Организация.
//   Период            - Дата - Период дат.
//   ДанныеПоказателей - таблица значений.
//		Структура таблицы ДанныеПоказателей.
//			Сотрудник
//			ФондОплатыТруда
//			ПроцентГодовойПремии
//
Процедура ДополнитьТаблицуПроцентомГодовойПремии(Организация, Период, ДанныеПоказателей) Экспорт
	
	ДанныеПоказателей.Свернуть("Сотрудник, ПроцентГодовойПремии", "Сумма");
	
	НастройкиУчетаЗарплаты = РегистрыСведений.НастройкиУчетаЗарплаты.Получить(Новый Структура("Организация", Организация));
	РазмерЕжегоднойПремии  = НастройкиУчетаЗарплаты.РазмерЕжегоднойПремии;
	
	ДанныеПоказателей.ЗаполнитьЗначения(РазмерЕжегоднойПремии, "ПроцентГодовойПремии");
	
КонецПроцедуры

// Процедура предназначена для формирования списка оплачиваемых за счет резерва отпусков
// с учетом специфики места внедрения.
//
// Параметры:
//   МассивВидовОтпусковРезерва - Массив.
//
Процедура ПолучитьМассивВидовОтпусковРезерва(МассивВидовОтпусковРезерва) Экспорт
	
	МассивВидовОтпусковРезерва.Добавить("Основной");
	
КонецПроцедуры

#КонецОбласти
